import type { ICategory } from "../types/types";

export const CustomDesignProductsMock: ICategory[] = [
  {
    "id": 0,
    "title": "Бархатные стикеры",
    "description": "Тактильный антистресс",
    "products": [
      {
        "id": 5,
        "preview": "http://qa-games.ru/astore/public/images/43306375.jpeg",
        "title": "Худи с бархатными стикерами",
        "subtitle": "Выберите один из восьми стикеров",
        "price": 4199,
        "description": "Выберите стикер, а мы перенесём его на ткань — как на фото. Одежду можно стирать в машинке при 30 °C, вывернув наизнанку. Гладить — с внутренней стороны. Посмотреть и потрогать все стикеры можно в A-Store на Технопарке. А ещё там можно добавить сразу несколько стикеров на одну вещь.",
        "availability": true
      },
      {
        "id": 6,
        "preview": "http://qa-games.ru/astore/public/images/61646585.png",
        "title": "Футболка с бархатными стикерами",
        "subtitle": "Все варианты — внутри",
        "price": 1799,
        "description": "Выберите стикер, а мы перенесём его на ткань — как на фото. Одежду можно стирать в машинке при 30 °C, вывернув наизнанку. Гладить — с внутренней стороны. Посмотреть и потрогать все стикеры можно в A-Store на Технопарке. А ещё там можно добавить сразу несколько стикеров на одну вещь.",
        "availability": true
      },
      {
        "id": 7,
        "preview": "http://qa-games.ru/astore/public/images/51168667.png",
        "title": "Футболка оверсайз с бархатными стикерами",
        "subtitle": "Нажмите, чтобы выбрать стикер",
        "price": 1799,
        "description": "Выберите стикер, а мы перенесём его на ткань — как на фото. Одежду можно стирать в машинке при 30 °C, вывернув наизнанку. Гладить — с внутренней стороны. Посмотреть и потрогать все стикеры можно в A-Store на Технопарке. А ещё там можно добавить сразу несколько стикеров на одну вещь.",
        "availability": true
      }
    ]
  },
  {
    "id": 1,
    "title": "FLAT-стикеры",
    "description": "Тема для обсуждения в любой компании",
    "products": [
      {
        "id": 8,
        "preview": "http://qa-games.ru/astore/public/images/80077475.png",
        "title": "Худи с FLAT-стикерами",
        "subtitle": "Выберите один из 20 стикеров",
        "price": 4149,
        "description": "Выберите стикер, а мы перенесём его на ткань — как на фото. Одежду можно стирать в машинке при 30 °C, вывернув наизнанку. Гладить — с внутренней стороны. Посмотреть и потрогать все стикеры можно в A-Store на Технопарке. А ещё там можно добавить сразу несколько стикеров на одну вещь.",
        "availability": true
      },
      {
        "id": 9,
        "preview": "http://qa-games.ru/astore/public/images/64963633.png",
        "title": "Футболка с FLAT-стикерами",
        "subtitle": "Все варианты — внутри",
        "price": 1749,
        "description": "Выберите стикер, а мы перенесём его на ткань — как на фото. Одежду можно стирать в машинке при 30 °C, вывернув наизнанку. Гладить — с внутренней стороны. Посмотреть и потрогать все стикеры можно в A-Store на Технопарке. А ещё там можно добавить сразу несколько стикеров на одну вещь.",
        "availability": true
      },
      {
        "id": 10,
        "preview": "http://qa-games.ru/astore/public/images/48495271.png",
        "title": "Футболка оверсайз с FLAT-стикерами",
        "subtitle": "Нажмите, чтобы выбрать стикер",
        "price": 1949,
        "description": "Выберите стикер, а мы перенесём его на ткань — как на фото. Одежду можно стирать в машинке при 30 °C, вывернув наизнанку. Гладить — с внутренней стороны. Посмотреть и потрогать все стикеры можно в A-Store на Технопарке. А ещё там можно добавить сразу несколько стикеров на одну вещь.",
        "availability": true
      }
    ]
  },
  {
    "id": 2,
    "title": "3D-стикеры",
    "description": "Дизайн с эффектом объёмного градиента",
    "products": [
      {
        "id": 11,
        "preview": "http://qa-games.ru/astore/public/images/89787126.png",
        "title": "Худи с 3D-стикерами",
        "subtitle": "Нажмите, чтобы выбрать стикер",
        "price": 4099,
        "description": "Выберите стикер, а мы перенесём его на ткань — как на фото. Одежду можно стирать в машинке при 30 °C, вывернув наизнанку. Гладить — с внутренней стороны. Посмотреть и потрогать все стикеры можно в A-Store на Технопарке. А ещё там можно добавить сразу несколько стикеров на одну вещь.",
        "availability": true
      },
      {
        "id": 12,
        "preview": "http://qa-games.ru/astore/public/images/85987507.png",
        "title": "Футболка с 3D-стикерами",
        "subtitle": "Все варианты — внутри",
        "price": 1699,
        "description": "Выберите стикер, а мы перенесём его на ткань — как на фото. Одежду можно стирать в машинке при 30 °C, вывернув наизнанку. Гладить — с внутренней стороны. Посмотреть и потрогать все стикеры можно в A-Store на Технопарке. А ещё там можно добавить сразу несколько стикеров на одну вещь.",
        "availability": true
      },
      {
        "id": 13,
        "preview": "http://qa-games.ru/astore/public/images/79520262.png",
        "title": "Футболка оверсайз с 3D-стикерами",
        "subtitle": "Нажмите, чтобы выбрать стикер",
        "price": 1899,
        "description": "Выберите стикер, а мы перенесём его на ткань — как на фото. Одежду можно стирать в машинке при 30 °C, вывернув наизнанку. Гладить — с внутренней стороны. Посмотреть и потрогать все стикеры можно в A-Store на Технопарке. А ещё там можно добавить сразу несколько стикеров на одну вещь.",
        "availability": true
      }
    ]
  }
];